tap "charmbracelet/tap"
tap "fastly/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "knqyf263/pet"
tap "libsql/sqld"
tap "natesales/repo", "https://github.com/natesales/repo"
tap "neilotoole/sq"
tap "tursodatabase/tap"
# New file format for still image compression
brew "jpeg-xl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Library for manipulating fonts
brew "fonttools"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# High-level command-line interface for Git
brew "git-town"
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Full-rich client for the Registry Data Access Protocol (RDAP) sponsored by ICANN
brew "icann-rdap"
# Official CLI for the IPinfo IP Address API
brew "ipinfo-cli"
# Simple terminal UI for git commands
brew "lazygit"
# YAML Parser
brew "libyaml"
# Move files and folders to the trash
brew "macos-trash", link: true
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@17", restart_service: :changed, link: true
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Syntax-aware linter for prose
brew "vale"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A CLI for interacting with the Fastly platform
brew "fastly/tap/fastly"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# The libsql-server application
brew "libsql/sqld/sqld"
brew "natesales/repo/q"
# sq data wrangler
brew "neilotoole/sq/sq"
brew "tursodatabase/tap/turso"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Screen saver based on animations presented during Apple Special Event Brooklyn
cask "brooklyn"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox@nightly"
cask "font-commit-mono-nerd-font"
cask "font-new-computer-modern"
# Font viewer for various font formats
cask "fontgoggles"
# Apple Mail plugin for GnuPG encrypted e-mails
cask "free-gpgmail"
# YouTube player focusing on privacy
cask "freetube"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# Free and open-source RSS reader
cask "netnewswire"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Collection of apps available by subscription
cask "setapp"
# Instant messaging application focusing on security
cask "signal"
# Mesh VPN based on WireGuard
cask "tailscale"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# WordPress local development environment
cask "wordpresscom-studio"
