tap "bazelbuild/tap"
tap "beeftornado/rmtree"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "planetscale/tap"
brew "ack"
brew "awscli"
brew "bat"
brew "deno"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "glib"
brew "jpeg"
brew "jq"
brew "lazygit"
brew "libtool"
brew "mysql-client@5.7"
brew "nmap"
brew "pkg-config"
brew "rename"
brew "shellcheck"
brew "starship"
brew "stow"
brew "terraform"
brew "tree"
brew "youtube-dl"
brew "zplug"
brew "planetscale/tap/pscale"
cask "aws-vault"
cask "brooklyn"
cask "caprine"
cask "firefox"
cask "firefox-nightly"
cask "font-hasklig-nerd-font-mono"
cask "freetube"
cask "google-chrome"
cask "obsidian"
cask "signal"
cask "visual-studio-code"
